import { Program } from '../types';

export const PROGRAMS: Program[] = [
    {
        id: 1,
        title: "Новичок",
        prices: {
            1: 5200,
            3: 11990,
            6: 19990,
            12: 44990
        },
        originalPrices: {
            1: 5200,
            3: 15600,
            6: 31200,
            12: 62400
        },
        image: "/junior-tariff.png",
        features: ["2 раза в неделю (8 занятий/мес)", "Базовая подготовка", "Групповые занятия", "Безопасная среда"]
    },
    {
        id: 2,
        title: "Профессионал",
        prices: {
            1: 7790,
            3: 17990,
            6: 29990,
            12: 55990
        },
        originalPrices: {
            1: 7800,
            3: 23400,
            6: 46800,
            12: 93600
        },
        image: "/champion-tariff.png",
        features: ["3 раза в неделю (12 занятий/мес)", "Интенсивная подготовка", "Отработка тактики", "Спортивный анализ"]
    },
    {
        id: 3,
        title: "Чемпион",
        prices: {
            1: 9900,
            3: 23990,
            6: 39990,
            12: 79990
        },
        originalPrices: {
            1: 10400,
            3: 31200,
            6: 62400,
            12: 124800
        },
        image: "/pro-tariff.png",
        features: ["4 раза в неделю", "Игровая практика", "Путь в сборную", "Полный комплект экипировки"]
    }
];

export const PROMO_BANNER_TEXT = "🔥 АКЦИЯ • Стоимость занятия от 420 ₽";
